# Triton vLLM Backend Configuration
# Optimized for IBM Fusion HCI OpenShift with A100 MIG (20GB)
#
# Author: Deepak Soni
# Contact: deepak.satna@gmail.com

backend: "vllm"
max_batch_size: 0

model_transaction_policy {
  decoupled: True
}

input [
  {
    name: "text_input"
    data_type: TYPE_STRING
    dims: [ 1 ]
  },
  {
    name: "stream"
    data_type: TYPE_BOOL
    dims: [ 1 ]
    optional: true
  },
  {
    name: "sampling_parameters"
    data_type: TYPE_STRING
    dims: [ 1 ]
    optional: true
  }
]

output [
  {
    name: "text_output"
    data_type: TYPE_STRING
    dims: [ -1 ]
  }
]

instance_group [
  {
    count: 1
    kind: KIND_MODEL
  }
]

# Model parameters optimized for 20GB MIG
parameters {
  key: "model"
  value: { string_value: "mistralai/Mistral-7B-Instruct-v0.2" }
}
parameters {
  key: "tensor_parallel_size"
  value: { string_value: "1" }
}
parameters {
  key: "gpu_memory_utilization"
  value: { string_value: "0.85" }
}
parameters {
  key: "max_model_len"
  value: { string_value: "2048" }
}
parameters {
  key: "dtype"
  value: { string_value: "half" }
}
parameters {
  key: "enforce_eager"
  value: { string_value: "true" }
}
